Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/drmtcm.h
#define DRMTCM_INTFLAG_ISERR_Pos              _UINT32_(0)                                          /* (DRMTCM_INTFLAG) ITCM Single Bit Error Detection Flag Position */
#define DRMTCM_INTFLAG_ISERR_Msk              (_UINT32_(0x1) << DRMTCM_INTFLAG_ISERR_Pos)          /* (DRMTCM_INTFLAG) ITCM Single Bit Error Detection Flag Mask */
#define DRMTCM_INTFLAG_ISERR(value)           (DRMTCM_INTFLAG_ISERR_Msk & (_UINT32_(value) << DRMTCM_INTFLAG_ISERR_Pos)) /* Assigment of value for ISERR in the DRMTCM_INTFLAG register */
#define DRMTCM_INTFLAG_IDERR_Pos              _UINT32_(1)                                          /* (DRMTCM_INTFLAG) ITCM Double Bit Error Detection Flag Position */
#define DRMTCM_INTFLAG_IDERR_Msk              (_UINT32_(0x1) << DRMTCM_INTFLAG_IDERR_Pos)          /* (DRMTCM_INTFLAG) ITCM Double Bit Error Detection Flag Mask */
#define DRMTCM_INTFLAG_IDERR(value)           (DRMTCM_INTFLAG_IDERR_Msk & (_UINT32_(value) << DRMTCM_INTFLAG_IDERR_Pos)) /* Assigment of value for IDERR in the DRMTCM_INTFLAG register */
#define DRMTCM_INTFLAG_IECCECNT_Pos           _UINT32_(2)                                          /* (DRMTCM_INTFLAG) ITCM ECC Error Count Flag Position */
#define DRMTCM_INTFLAG_IECCECNT_Msk           (_UINT32_(0x1) << DRMTCM_INTFLAG_IECCECNT_Pos)       /* (DRMTCM_INTFLAG) ITCM ECC Error Count Flag Mask */
#define DRMTCM_INTFLAG_IECCECNT(value)        (DRMTCM_INTFLAG_IECCECNT_Msk & (_UINT32_(value) << DRMTCM_INTFLAG_IECCECNT_Pos)) /* Assigment of value for IECCECNT in the DRMTCM_INTFLAG register */
#define DRMTCM_INTFLAG_D0SERR_Pos             _UINT32_(8)                                          /* (DRMTCM_INTFLAG) D0TCM Single Bit Error Detection Flag Position */
#define DRMTCM_INTFLAG_D0SERR_Msk             (_UINT32_(0x1) << DRMTCM_INTFLAG_D0SERR_Pos)         /* (DRMTCM_INTFLAG) D0TCM Single Bit Error Detection Flag Mask */
#define DRMTCM_INTFLAG_D0SERR(value)          (DRMTCM_INTFLAG_D0SERR_Msk & (_UINT32_(value) << DRMTCM_INTFLAG_D0SERR_Pos)) /* Assigment of value for D0SERR in the DRMTCM_INTFLAG register */
#define DRMTCM_INTFLAG_D0DERR_Pos             _UINT32_(9)                                          /* (DRMTCM_INTFLAG) D0TCM Double Bit Error Detection Flag Position */
#define DRMTCM_INTFLAG_D0DERR_Msk             (_UINT32_(0x1) << DRMTCM_INTFLAG_D0DERR_Pos)         /* (DRMTCM_INTFLAG) D0TCM Double Bit Error Detection Flag Mask */
#define DRMTCM_INTFLAG_D0DERR(value)          (DRMTCM_INTFLAG_D0DERR_Msk & (_UINT32_(value) << DRMTCM_INTFLAG_D0DERR_Pos)) /* Assigment of value for D0DERR in the DRMTCM_INTFLAG register */
#define DRMTCM_INTFLAG_D0ECCECNT_Pos          _UINT32_(10)                                         /* (DRMTCM_INTFLAG) D0TCM ECC Error Count Flag Position */
#define DRMTCM_INTFLAG_D0ECCECNT_Msk          (_UINT32_(0x1) << DRMTCM_INTFLAG_D0ECCECNT_Pos)      /* (DRMTCM_INTFLAG) D0TCM ECC Error Count Flag Mask */
#define DRMTCM_INTFLAG_D0ECCECNT(value)       (DRMTCM_INTFLAG_D0ECCECNT_Msk & (_UINT32_(value) << DRMTCM_INTFLAG_D0ECCECNT_Pos)) /* Assigment of value for D0ECCECNT in the DRMTCM_INTFLAG register */
#define DRMTCM_INTFLAG_D1SERR_Pos             _UINT32_(16)                                         /* (DRMTCM_INTFLAG) D1TCM Single Bit Error Detection Flag Position */
#define DRMTCM_INTFLAG_D1SERR_Msk             (_UINT32_(0x1) << DRMTCM_INTFLAG_D1SERR_Pos)         /* (DRMTCM_INTFLAG) D1TCM Single Bit Error Detection Flag Mask */
#define DRMTCM_INTFLAG_D1SERR(value)          (DRMTCM_INTFLAG_D1SERR_Msk & (_UINT32_(value) << DRMTCM_INTFLAG_D1SERR_Pos)) /* Assigment of value for D1SERR in the DRMTCM_INTFLAG register */
#define DRMTCM_INTFLAG_D1DERR_Pos             _UINT32_(17)                                         /* (DRMTCM_INTFLAG) D1TCM Double Bit Error Detection Flag Position */
#define DRMTCM_INTFLAG_D1DERR_Msk             (_UINT32_(0x1) << DRMTCM_INTFLAG_D1DERR_Pos)         /* (DRMTCM_INTFLAG) D1TCM Double Bit Error Detection Flag Mask */
#define DRMTCM_INTFLAG_D1DERR(value)          (DRMTCM_INTFLAG_D1DERR_Msk & (_UINT32_(value) << DRMTCM_INTFLAG_D1DERR_Pos)) /* Assigment of value for D1DERR in the DRMTCM_INTFLAG register */
#define DRMTCM_INTFLAG_D1ECCECNT_Pos          _UINT32_(18)                                         /* (DRMTCM_INTFLAG) D1TCM ECC Error Count Flag Position */
#define DRMTCM_INTFLAG_D1ECCECNT_Msk          (_UINT32_(0x1) << DRMTCM_INTFLAG_D1ECCECNT_Pos)      /* (DRMTCM_INTFLAG) D1TCM ECC Error Count Flag Mask */
#define DRMTCM_INTFLAG_D1ECCECNT(value)       (DRMTCM_INTFLAG_D1ECCECNT_Msk & (_UINT32_(value) << DRMTCM_INTFLAG_D1ECCECNT_Pos)) /* Assigment of value for D1ECCECNT in the DRMTCM_INTFLAG register */
#define DRMTCM_INTFLAG_FLTCAP_Pos             _UINT32_(24)                                         /* (DRMTCM_INTFLAG) Fault Capture interrupt Position */
#define DRMTCM_INTFLAG_FLTCAP_Msk             (_UINT32_(0x1) << DRMTCM_INTFLAG_FLTCAP_Pos)         /* (DRMTCM_INTFLAG) Fault Capture interrupt Mask */
#define DRMTCM_INTFLAG_FLTCAP(value)          (DRMTCM_INTFLAG_FLTCAP_Msk & (_UINT32_(value) << DRMTCM_INTFLAG_FLTCAP_Pos)) /* Assigment of value for FLTCAP in the DRMTCM_INTFLAG register */
#define DRMTCM_INTFLAG_Msk                    _UINT32_(0x01070707)                                 /* (DRMTCM_INTFLAG) Register Mask  */


/* -------- DRMTCM_FLTCTRL : (DRMTCM Offset: 0x18) (R/W 32) FAULT INJECTION CONTROL REGISTER -------- */
#define DRMTCM_FLTCTRL_RESETVALUE             _UINT32_(0x00)                                       /*  (DRMTCM_FLTCTRL) FAULT INJECTION CONTROL REGISTER  Reset Value */

#define DRMTCM_FLTCTRL_FLTEN_Pos              _UINT32_(1)                                          /* (DRMTCM_FLTCTRL) Fault Injection Enabled Position */
#define DRMTCM_FLTCTRL_FLTEN_Msk              (_UINT32_(0x1) << DRMTCM_FLTCTRL_FLTEN_Pos)          /* (DRMTCM_FLTCTRL) Fault Injection Enabled Mask */
#define DRMTCM_FLTCTRL_FLTEN(value)           (DRMTCM_FLTCTRL_FLTEN_Msk & (_UINT32_(value) << DRMTCM_FLTCTRL_FLTEN_Pos)) /* Assigment of value for FLTEN in the DRMTCM_FLTCTRL register */
#define DRMTCM_FLTCTRL_FLTMD_Pos              _UINT32_(12)                                         /* (DRMTCM_FLTCTRL) Fault Mode Control Position */
#define DRMTCM_FLTCTRL_FLTMD_Msk              (_UINT32_(0x3) << DRMTCM_FLTCTRL_FLTMD_Pos)          /* (DRMTCM_FLTCTRL) Fault Mode Control Mask */
#define DRMTCM_FLTCTRL_FLTMD(value)           (DRMTCM_FLTCTRL_FLTMD_Msk & (_UINT32_(value) << DRMTCM_FLTCTRL_FLTMD_Pos)) /* Assigment of value for FLTMD in the DRMTCM_FLTCTRL register */
#define DRMTCM_FLTCTRL_Msk                    _UINT32_(0x00003002)                                 /* (DRMTCM_FLTCTRL) Register Mask  */


/* -------- DRMTCM_IFLTPTR : (DRMTCM Offset: 0x1C) (R/W 32) ITCM FAULT INJECTION POINTER REGISTER -------- */
#define DRMTCM_IFLTPTR_RESETVALUE             _UINT32_(0x00)                                       /*  (DRMTCM_IFLTPTR) ITCM FAULT INJECTION POINTER REGISTER  Reset Value */

#define DRMTCM_IFLTPTR_FLT1PTR_Pos            _UINT32_(0)                                          /* (DRMTCM_IFLTPTR) ECC Fault injection Bit position pointer (for single bit error). Position */
#define DRMTCM_IFLTPTR_FLT1PTR_Msk            (_UINT32_(0x7F) << DRMTCM_IFLTPTR_FLT1PTR_Pos)       /* (DRMTCM_IFLTPTR) ECC Fault injection Bit position pointer (for single bit error). Mask */
#define DRMTCM_IFLTPTR_FLT1PTR(value)         (DRMTCM_IFLTPTR_FLT1PTR_Msk & (_UINT32_(value) << DRMTCM_IFLTPTR_FLT1PTR_Pos)) /* Assigment of value for FLT1PTR in the DRMTCM_IFLTPTR register */
#define DRMTCM_IFLTPTR_FLT2PTR_Pos            _UINT32_(16)                                         /* (DRMTCM_IFLTPTR) ECC Fault injection Bit position pointer (for double bit error). Position */
#define DRMTCM_IFLTPTR_FLT2PTR_Msk            (_UINT32_(0x7F) << DRMTCM_IFLTPTR_FLT2PTR_Pos)       /* (DRMTCM_IFLTPTR) ECC Fault injection Bit position pointer (for double bit error). Mask */
#define DRMTCM_IFLTPTR_FLT2PTR(value)         (DRMTCM_IFLTPTR_FLT2PTR_Msk & (_UINT32_(value) << DRMTCM_IFLTPTR_FLT2PTR_Pos)) /* Assigment of value for FLT2PTR in the DRMTCM_IFLTPTR register */
#define DRMTCM_IFLTPTR_Msk                    _UINT32_(0x007F007F)                                 /* (DRMTCM_IFLTPTR) Register Mask  */


